benchmarks/multiworker_raw_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6_query_load.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 3m30s max duration (incl. graceful stop):
              * query_mix: 50 looping VUs for 3m0s (gracefulStop: 30s)


Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

running (0m16.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
query_mix   [   0% ] 50 VUs  0m00.0s/3m0s

running (0m17.0s), 50/50 VUs, 85 complete and 0 interrupted iterations
query_mix   [   1% ] 50 VUs  0m01.0s/3m0s

running (0m18.0s), 50/50 VUs, 292 complete and 0 interrupted iterations
query_mix   [   1% ] 50 VUs  0m02.0s/3m0s

running (0m19.0s), 50/50 VUs, 525 complete and 0 interrupted iterations
query_mix   [   2% ] 50 VUs  0m03.0s/3m0s

running (0m20.0s), 50/50 VUs, 766 complete and 0 interrupted iterations
query_mix   [   2% ] 50 VUs  0m04.0s/3m0s

running (0m21.0s), 50/50 VUs, 1012 complete and 0 interrupted iterations
query_mix   [   3% ] 50 VUs  0m05.0s/3m0s

running (0m22.0s), 50/50 VUs, 1251 complete and 0 interrupted iterations
query_mix   [   3% ] 50 VUs  0m06.0s/3m0s

running (0m23.0s), 50/50 VUs, 1493 complete and 0 interrupted iterations
query_mix   [   4% ] 50 VUs  0m07.0s/3m0s

running (0m24.0s), 50/50 VUs, 1731 complete and 0 interrupted iterations
query_mix   [   4% ] 50 VUs  0m08.0s/3m0s

running (0m25.0s), 50/50 VUs, 1963 complete and 0 interrupted iterations
query_mix   [   5% ] 50 VUs  0m09.0s/3m0s

running (0m26.0s), 50/50 VUs, 2203 complete and 0 interrupted iterations
query_mix   [   6% ] 50 VUs  0m10.0s/3m0s

running (0m27.0s), 50/50 VUs, 2450 complete and 0 interrupted iterations
query_mix   [   6% ] 50 VUs  0m11.0s/3m0s

running (0m28.0s), 50/50 VUs, 2690 complete and 0 interrupted iterations
query_mix   [   7% ] 50 VUs  0m12.0s/3m0s

running (0m29.0s), 50/50 VUs, 2928 complete and 0 interrupted iterations
query_mix   [   7% ] 50 VUs  0m13.0s/3m0s

running (0m30.0s), 50/50 VUs, 3167 complete and 0 interrupted iterations
query_mix   [   8% ] 50 VUs  0m14.0s/3m0s

running (0m31.0s), 50/50 VUs, 3405 complete and 0 interrupted iterations
query_mix   [   8% ] 50 VUs  0m15.0s/3m0s

running (0m32.0s), 50/50 VUs, 3650 complete and 0 interrupted iterations
query_mix   [   9% ] 50 VUs  0m16.0s/3m0s

running (0m33.0s), 50/50 VUs, 3892 complete and 0 interrupted iterations
query_mix   [   9% ] 50 VUs  0m17.0s/3m0s

running (0m34.0s), 50/50 VUs, 4133 complete and 0 interrupted iterations
query_mix   [  10% ] 50 VUs  0m18.0s/3m0s

running (0m35.0s), 50/50 VUs, 4370 complete and 0 interrupted iterations
query_mix   [  11% ] 50 VUs  0m19.0s/3m0s

running (0m36.0s), 50/50 VUs, 4612 complete and 0 interrupted iterations
query_mix   [  11% ] 50 VUs  0m20.0s/3m0s

running (0m37.0s), 50/50 VUs, 4853 complete and 0 interrupted iterations
query_mix   [  12% ] 50 VUs  0m21.0s/3m0s

running (0m38.0s), 50/50 VUs, 5099 complete and 0 interrupted iterations
query_mix   [  12% ] 50 VUs  0m22.0s/3m0s

running (0m39.0s), 50/50 VUs, 5343 complete and 0 interrupted iterations
query_mix   [  13% ] 50 VUs  0m23.0s/3m0s

running (0m40.0s), 50/50 VUs, 5585 complete and 0 interrupted iterations
query_mix   [  13% ] 50 VUs  0m24.0s/3m0s

running (0m41.0s), 50/50 VUs, 5820 complete and 0 interrupted iterations
query_mix   [  14% ] 50 VUs  0m25.0s/3m0s

running (0m42.0s), 50/50 VUs, 6061 complete and 0 interrupted iterations
query_mix   [  14% ] 50 VUs  0m26.0s/3m0s

running (0m43.0s), 50/50 VUs, 6304 complete and 0 interrupted iterations
query_mix   [  15% ] 50 VUs  0m27.0s/3m0s

running (0m44.0s), 50/50 VUs, 6545 complete and 0 interrupted iterations
query_mix   [  16% ] 50 VUs  0m28.0s/3m0s

running (0m45.0s), 50/50 VUs, 6782 complete and 0 interrupted iterations
query_mix   [  16% ] 50 VUs  0m29.0s/3m0s

running (0m46.0s), 50/50 VUs, 7017 complete and 0 interrupted iterations
query_mix   [  17% ] 50 VUs  0m30.0s/3m0s

running (0m47.0s), 50/50 VUs, 7261 complete and 0 interrupted iterations
query_mix   [  17% ] 50 VUs  0m31.0s/3m0s

running (0m48.0s), 50/50 VUs, 7501 complete and 0 interrupted iterations
query_mix   [  18% ] 50 VUs  0m32.0s/3m0s

running (0m49.0s), 50/50 VUs, 7739 complete and 0 interrupted iterations
query_mix   [  18% ] 50 VUs  0m33.0s/3m0s

running (0m50.0s), 50/50 VUs, 7984 complete and 0 interrupted iterations
query_mix   [  19% ] 50 VUs  0m34.0s/3m0s

running (0m51.0s), 50/50 VUs, 8230 complete and 0 interrupted iterations
query_mix   [  19% ] 50 VUs  0m35.0s/3m0s

running (0m52.0s), 50/50 VUs, 8470 complete and 0 interrupted iterations
query_mix   [  20% ] 50 VUs  0m36.0s/3m0s

running (0m53.0s), 50/50 VUs, 8708 complete and 0 interrupted iterations
query_mix   [  21% ] 50 VUs  0m37.0s/3m0s

running (0m54.0s), 50/50 VUs, 8950 complete and 0 interrupted iterations
query_mix   [  21% ] 50 VUs  0m38.0s/3m0s

running (0m55.0s), 50/50 VUs, 9194 complete and 0 interrupted iterations
query_mix   [  22% ] 50 VUs  0m39.0s/3m0s

running (0m56.0s), 50/50 VUs, 9439 complete and 0 interrupted iterations
query_mix   [  22% ] 50 VUs  0m40.0s/3m0s

running (0m57.0s), 50/50 VUs, 9680 complete and 0 interrupted iterations
query_mix   [  23% ] 50 VUs  0m41.0s/3m0s

running (0m58.0s), 50/50 VUs, 9920 complete and 0 interrupted iterations
query_mix   [  23% ] 50 VUs  0m42.0s/3m0s

running (0m59.0s), 50/50 VUs, 10157 complete and 0 interrupted iterations
query_mix   [  24% ] 50 VUs  0m43.0s/3m0s

running (1m00.0s), 50/50 VUs, 10404 complete and 0 interrupted iterations
query_mix   [  24% ] 50 VUs  0m44.0s/3m0s

running (1m01.0s), 50/50 VUs, 10642 complete and 0 interrupted iterations
query_mix   [  25% ] 50 VUs  0m45.0s/3m0s

running (1m02.0s), 50/50 VUs, 10884 complete and 0 interrupted iterations
query_mix   [  26% ] 50 VUs  0m46.0s/3m0s

running (1m03.0s), 50/50 VUs, 11126 complete and 0 interrupted iterations
query_mix   [  26% ] 50 VUs  0m47.0s/3m0s

running (1m04.0s), 50/50 VUs, 11362 complete and 0 interrupted iterations
query_mix   [  27% ] 50 VUs  0m48.0s/3m0s

running (1m05.0s), 50/50 VUs, 11606 complete and 0 interrupted iterations
query_mix   [  27% ] 50 VUs  0m49.0s/3m0s

running (1m06.0s), 50/50 VUs, 11850 complete and 0 interrupted iterations
query_mix   [  28% ] 50 VUs  0m50.0s/3m0s

running (1m07.0s), 50/50 VUs, 12093 complete and 0 interrupted iterations
query_mix   [  28% ] 50 VUs  0m51.0s/3m0s

running (1m08.0s), 50/50 VUs, 12334 complete and 0 interrupted iterations
query_mix   [  29% ] 50 VUs  0m52.0s/3m0s

running (1m09.0s), 50/50 VUs, 12569 complete and 0 interrupted iterations
query_mix   [  29% ] 50 VUs  0m53.0s/3m0s

running (1m10.0s), 50/50 VUs, 12807 complete and 0 interrupted iterations
query_mix   [  30% ] 50 VUs  0m54.0s/3m0s

running (1m11.0s), 50/50 VUs, 13053 complete and 0 interrupted iterations
query_mix   [  31% ] 50 VUs  0m55.0s/3m0s

running (1m12.0s), 50/50 VUs, 13299 complete and 0 interrupted iterations
query_mix   [  31% ] 50 VUs  0m56.0s/3m0s

running (1m13.0s), 50/50 VUs, 13537 complete and 0 interrupted iterations
query_mix   [  32% ] 50 VUs  0m57.0s/3m0s

running (1m14.0s), 50/50 VUs, 13774 complete and 0 interrupted iterations
query_mix   [  32% ] 50 VUs  0m58.0s/3m0s

running (1m15.0s), 50/50 VUs, 14009 complete and 0 interrupted iterations
query_mix   [  33% ] 50 VUs  0m59.0s/3m0s

running (1m16.0s), 50/50 VUs, 14256 complete and 0 interrupted iterations
query_mix   [  33% ] 50 VUs  1m00.0s/3m0s

running (1m17.0s), 50/50 VUs, 14498 complete and 0 interrupted iterations
query_mix   [  34% ] 50 VUs  1m01.0s/3m0s

running (1m18.0s), 50/50 VUs, 14732 complete and 0 interrupted iterations
query_mix   [  34% ] 50 VUs  1m02.0s/3m0s

running (1m19.0s), 50/50 VUs, 14970 complete and 0 interrupted iterations
query_mix   [  35% ] 50 VUs  1m03.0s/3m0s

running (1m20.0s), 50/50 VUs, 15215 complete and 0 interrupted iterations
query_mix   [  36% ] 50 VUs  1m04.0s/3m0s

running (1m21.0s), 50/50 VUs, 15457 complete and 0 interrupted iterations
query_mix   [  36% ] 50 VUs  1m05.0s/3m0s

running (1m22.0s), 50/50 VUs, 15699 complete and 0 interrupted iterations
query_mix   [  37% ] 50 VUs  1m06.0s/3m0s

running (1m23.0s), 50/50 VUs, 15938 complete and 0 interrupted iterations
query_mix   [  37% ] 50 VUs  1m07.0s/3m0s

running (1m24.0s), 50/50 VUs, 16175 complete and 0 interrupted iterations
query_mix   [  38% ] 50 VUs  1m08.0s/3m0s

running (1m25.0s), 50/50 VUs, 16415 complete and 0 interrupted iterations
query_mix   [  38% ] 50 VUs  1m09.0s/3m0s

running (1m26.0s), 50/50 VUs, 16661 complete and 0 interrupted iterations
query_mix   [  39% ] 50 VUs  1m10.0s/3m0s

running (1m27.0s), 50/50 VUs, 16905 complete and 0 interrupted iterations
query_mix   [  39% ] 50 VUs  1m11.0s/3m0s

running (1m28.0s), 50/50 VUs, 17134 complete and 0 interrupted iterations
query_mix   [  40% ] 50 VUs  1m12.0s/3m0s

running (1m29.0s), 50/50 VUs, 17375 complete and 0 interrupted iterations
query_mix   [  41% ] 50 VUs  1m13.0s/3m0s

running (1m30.0s), 50/50 VUs, 17614 complete and 0 interrupted iterations
query_mix   [  41% ] 50 VUs  1m14.0s/3m0s

running (1m31.0s), 50/50 VUs, 17844 complete and 0 interrupted iterations
query_mix   [  42% ] 50 VUs  1m15.0s/3m0s

running (1m32.0s), 50/50 VUs, 18084 complete and 0 interrupted iterations
query_mix   [  42% ] 50 VUs  1m16.0s/3m0s

running (1m33.0s), 50/50 VUs, 18328 complete and 0 interrupted iterations
query_mix   [  43% ] 50 VUs  1m17.0s/3m0s

running (1m34.0s), 50/50 VUs, 18568 complete and 0 interrupted iterations
query_mix   [  43% ] 50 VUs  1m18.0s/3m0s

running (1m35.0s), 50/50 VUs, 18806 complete and 0 interrupted iterations
query_mix   [  44% ] 50 VUs  1m19.0s/3m0s

running (1m36.0s), 50/50 VUs, 19046 complete and 0 interrupted iterations
query_mix   [  44% ] 50 VUs  1m20.0s/3m0s

running (1m37.0s), 50/50 VUs, 19286 complete and 0 interrupted iterations
query_mix   [  45% ] 50 VUs  1m21.0s/3m0s

running (1m38.0s), 50/50 VUs, 19528 complete and 0 interrupted iterations
query_mix   [  46% ] 50 VUs  1m22.0s/3m0s

running (1m39.0s), 50/50 VUs, 19770 complete and 0 interrupted iterations
query_mix   [  46% ] 50 VUs  1m23.0s/3m0s

running (1m40.0s), 50/50 VUs, 20013 complete and 0 interrupted iterations
query_mix   [  47% ] 50 VUs  1m24.0s/3m0s

running (1m41.0s), 50/50 VUs, 20257 complete and 0 interrupted iterations
query_mix   [  47% ] 50 VUs  1m25.0s/3m0s

running (1m42.0s), 50/50 VUs, 20496 complete and 0 interrupted iterations
query_mix   [  48% ] 50 VUs  1m26.0s/3m0s

running (1m43.0s), 50/50 VUs, 20730 complete and 0 interrupted iterations
query_mix   [  48% ] 50 VUs  1m27.0s/3m0s

running (1m44.0s), 50/50 VUs, 20979 complete and 0 interrupted iterations
query_mix   [  49% ] 50 VUs  1m28.0s/3m0s

running (1m45.0s), 50/50 VUs, 21221 complete and 0 interrupted iterations
query_mix   [  49% ] 50 VUs  1m29.0s/3m0s

running (1m46.0s), 50/50 VUs, 21462 complete and 0 interrupted iterations
query_mix   [  50% ] 50 VUs  1m30.0s/3m0s

running (1m47.0s), 50/50 VUs, 21698 complete and 0 interrupted iterations
query_mix   [  51% ] 50 VUs  1m31.0s/3m0s

running (1m48.0s), 50/50 VUs, 21938 complete and 0 interrupted iterations
query_mix   [  51% ] 50 VUs  1m32.0s/3m0s

running (1m49.0s), 50/50 VUs, 22179 complete and 0 interrupted iterations
query_mix   [  52% ] 50 VUs  1m33.0s/3m0s

running (1m50.0s), 50/50 VUs, 22423 complete and 0 interrupted iterations
query_mix   [  52% ] 50 VUs  1m34.0s/3m0s

running (1m51.0s), 50/50 VUs, 22667 complete and 0 interrupted iterations
query_mix   [  53% ] 50 VUs  1m35.0s/3m0s

running (1m52.0s), 50/50 VUs, 22890 complete and 0 interrupted iterations
query_mix   [  53% ] 50 VUs  1m36.0s/3m0s

running (1m53.0s), 50/50 VUs, 23126 complete and 0 interrupted iterations
query_mix   [  54% ] 50 VUs  1m37.0s/3m0s

running (1m54.0s), 50/50 VUs, 23364 complete and 0 interrupted iterations
query_mix   [  54% ] 50 VUs  1m38.0s/3m0s

running (1m55.0s), 50/50 VUs, 23608 complete and 0 interrupted iterations
query_mix   [  55% ] 50 VUs  1m39.0s/3m0s

running (1m56.0s), 50/50 VUs, 23854 complete and 0 interrupted iterations
query_mix   [  56% ] 50 VUs  1m40.0s/3m0s

running (1m57.0s), 50/50 VUs, 24098 complete and 0 interrupted iterations
query_mix   [  56% ] 50 VUs  1m41.0s/3m0s

running (1m58.0s), 50/50 VUs, 24337 complete and 0 interrupted iterations
query_mix   [  57% ] 50 VUs  1m42.0s/3m0s

running (1m59.0s), 50/50 VUs, 24578 complete and 0 interrupted iterations
query_mix   [  57% ] 50 VUs  1m43.0s/3m0s

running (2m00.0s), 50/50 VUs, 24813 complete and 0 interrupted iterations
query_mix   [  58% ] 50 VUs  1m44.0s/3m0s

running (2m01.0s), 50/50 VUs, 25054 complete and 0 interrupted iterations
query_mix   [  58% ] 50 VUs  1m45.0s/3m0s

running (2m02.0s), 50/50 VUs, 25304 complete and 0 interrupted iterations
query_mix   [  59% ] 50 VUs  1m46.0s/3m0s

running (2m03.0s), 50/50 VUs, 25545 complete and 0 interrupted iterations
query_mix   [  59% ] 50 VUs  1m47.0s/3m0s

running (2m04.0s), 50/50 VUs, 25781 complete and 0 interrupted iterations
query_mix   [  60% ] 50 VUs  1m48.0s/3m0s

running (2m05.0s), 50/50 VUs, 26016 complete and 0 interrupted iterations
query_mix   [  61% ] 50 VUs  1m49.0s/3m0s

running (2m06.0s), 50/50 VUs, 26256 complete and 0 interrupted iterations
query_mix   [  61% ] 50 VUs  1m50.0s/3m0s

running (2m07.0s), 50/50 VUs, 26503 complete and 0 interrupted iterations
query_mix   [  62% ] 50 VUs  1m51.0s/3m0s

running (2m08.0s), 50/50 VUs, 26746 complete and 0 interrupted iterations
query_mix   [  62% ] 50 VUs  1m52.0s/3m0s

running (2m09.0s), 50/50 VUs, 26974 complete and 0 interrupted iterations
query_mix   [  63% ] 50 VUs  1m53.0s/3m0s

running (2m10.0s), 50/50 VUs, 27216 complete and 0 interrupted iterations
query_mix   [  63% ] 50 VUs  1m54.0s/3m0s

running (2m11.0s), 50/50 VUs, 27457 complete and 0 interrupted iterations
query_mix   [  64% ] 50 VUs  1m55.0s/3m0s

running (2m12.0s), 50/50 VUs, 27698 complete and 0 interrupted iterations
query_mix   [  64% ] 50 VUs  1m56.0s/3m0s

running (2m13.0s), 50/50 VUs, 27936 complete and 0 interrupted iterations
query_mix   [  65% ] 50 VUs  1m57.0s/3m0s

running (2m14.0s), 50/50 VUs, 28178 complete and 0 interrupted iterations
query_mix   [  66% ] 50 VUs  1m58.0s/3m0s

running (2m15.0s), 50/50 VUs, 28416 complete and 0 interrupted iterations
query_mix   [  66% ] 50 VUs  1m59.0s/3m0s

running (2m16.0s), 50/50 VUs, 28653 complete and 0 interrupted iterations
query_mix   [  67% ] 50 VUs  2m00.0s/3m0s

running (2m17.0s), 50/50 VUs, 28885 complete and 0 interrupted iterations
query_mix   [  67% ] 50 VUs  2m01.0s/3m0s

running (2m18.0s), 50/50 VUs, 29129 complete and 0 interrupted iterations
query_mix   [  68% ] 50 VUs  2m02.0s/3m0s

running (2m19.0s), 50/50 VUs, 29370 complete and 0 interrupted iterations
query_mix   [  68% ] 50 VUs  2m03.0s/3m0s

running (2m20.0s), 50/50 VUs, 29611 complete and 0 interrupted iterations
query_mix   [  69% ] 50 VUs  2m04.0s/3m0s

running (2m21.0s), 50/50 VUs, 29852 complete and 0 interrupted iterations
query_mix   [  69% ] 50 VUs  2m05.0s/3m0s

running (2m22.0s), 50/50 VUs, 30088 complete and 0 interrupted iterations
query_mix   [  70% ] 50 VUs  2m06.0s/3m0s

running (2m23.0s), 50/50 VUs, 30333 complete and 0 interrupted iterations
query_mix   [  71% ] 50 VUs  2m07.0s/3m0s

running (2m24.0s), 50/50 VUs, 30577 complete and 0 interrupted iterations
query_mix   [  71% ] 50 VUs  2m08.0s/3m0s

running (2m25.0s), 50/50 VUs, 30811 complete and 0 interrupted iterations
query_mix   [  72% ] 50 VUs  2m09.0s/3m0s

running (2m26.0s), 50/50 VUs, 31045 complete and 0 interrupted iterations
query_mix   [  72% ] 50 VUs  2m10.0s/3m0s

running (2m27.0s), 50/50 VUs, 31284 complete and 0 interrupted iterations
query_mix   [  73% ] 50 VUs  2m11.0s/3m0s

running (2m28.0s), 50/50 VUs, 31526 complete and 0 interrupted iterations
query_mix   [  73% ] 50 VUs  2m12.0s/3m0s

running (2m29.0s), 50/50 VUs, 31766 complete and 0 interrupted iterations
query_mix   [  74% ] 50 VUs  2m13.0s/3m0s

running (2m30.0s), 50/50 VUs, 32003 complete and 0 interrupted iterations
query_mix   [  74% ] 50 VUs  2m14.0s/3m0s

running (2m31.0s), 50/50 VUs, 32244 complete and 0 interrupted iterations
query_mix   [  75% ] 50 VUs  2m15.0s/3m0s

running (2m32.0s), 50/50 VUs, 32489 complete and 0 interrupted iterations
query_mix   [  76% ] 50 VUs  2m16.0s/3m0s

running (2m33.0s), 50/50 VUs, 32733 complete and 0 interrupted iterations
query_mix   [  76% ] 50 VUs  2m17.0s/3m0s

running (2m34.0s), 50/50 VUs, 32970 complete and 0 interrupted iterations
query_mix   [  77% ] 50 VUs  2m18.0s/3m0s

running (2m35.0s), 50/50 VUs, 33209 complete and 0 interrupted iterations
query_mix   [  77% ] 50 VUs  2m19.0s/3m0s

running (2m36.0s), 50/50 VUs, 33448 complete and 0 interrupted iterations
query_mix   [  78% ] 50 VUs  2m20.0s/3m0s

running (2m37.0s), 50/50 VUs, 33690 complete and 0 interrupted iterations
query_mix   [  78% ] 50 VUs  2m21.0s/3m0s

running (2m38.0s), 50/50 VUs, 33933 complete and 0 interrupted iterations
query_mix   [  79% ] 50 VUs  2m22.0s/3m0s

running (2m39.0s), 50/50 VUs, 34174 complete and 0 interrupted iterations
query_mix   [  79% ] 50 VUs  2m23.0s/3m0s

running (2m40.0s), 50/50 VUs, 34411 complete and 0 interrupted iterations
query_mix   [  80% ] 50 VUs  2m24.0s/3m0s

running (2m41.0s), 50/50 VUs, 34655 complete and 0 interrupted iterations
query_mix   [  81% ] 50 VUs  2m25.0s/3m0s

running (2m42.0s), 50/50 VUs, 34897 complete and 0 interrupted iterations
query_mix   [  81% ] 50 VUs  2m26.0s/3m0s

running (2m43.0s), 50/50 VUs, 35139 complete and 0 interrupted iterations
query_mix   [  82% ] 50 VUs  2m27.0s/3m0s

running (2m44.0s), 50/50 VUs, 35383 complete and 0 interrupted iterations
query_mix   [  82% ] 50 VUs  2m28.0s/3m0s

running (2m45.0s), 50/50 VUs, 35622 complete and 0 interrupted iterations
query_mix   [  83% ] 50 VUs  2m29.0s/3m0s

running (2m46.0s), 50/50 VUs, 35859 complete and 0 interrupted iterations
query_mix   [  83% ] 50 VUs  2m30.0s/3m0s

running (2m47.0s), 50/50 VUs, 36105 complete and 0 interrupted iterations
query_mix   [  84% ] 50 VUs  2m31.0s/3m0s

running (2m48.0s), 50/50 VUs, 36341 complete and 0 interrupted iterations
query_mix   [  84% ] 50 VUs  2m32.0s/3m0s

running (2m49.0s), 50/50 VUs, 36567 complete and 0 interrupted iterations
query_mix   [  85% ] 50 VUs  2m33.0s/3m0s

running (2m50.0s), 50/50 VUs, 36798 complete and 0 interrupted iterations
query_mix   [  86% ] 50 VUs  2m34.0s/3m0s

running (2m51.0s), 50/50 VUs, 37039 complete and 0 interrupted iterations
query_mix   [  86% ] 50 VUs  2m35.0s/3m0s

running (2m52.0s), 50/50 VUs, 37277 complete and 0 interrupted iterations
query_mix   [  87% ] 50 VUs  2m36.0s/3m0s

running (2m53.0s), 50/50 VUs, 37519 complete and 0 interrupted iterations
query_mix   [  87% ] 50 VUs  2m37.0s/3m0s

running (2m54.0s), 50/50 VUs, 37755 complete and 0 interrupted iterations
query_mix   [  88% ] 50 VUs  2m38.0s/3m0s

running (2m55.0s), 50/50 VUs, 38002 complete and 0 interrupted iterations
query_mix   [  88% ] 50 VUs  2m39.0s/3m0s

running (2m56.0s), 50/50 VUs, 38244 complete and 0 interrupted iterations
query_mix   [  89% ] 50 VUs  2m40.0s/3m0s

running (2m57.0s), 50/50 VUs, 38481 complete and 0 interrupted iterations
query_mix   [  89% ] 50 VUs  2m41.0s/3m0s

running (2m58.0s), 50/50 VUs, 38719 complete and 0 interrupted iterations
query_mix   [  90% ] 50 VUs  2m42.0s/3m0s

running (2m59.0s), 50/50 VUs, 38961 complete and 0 interrupted iterations
query_mix   [  91% ] 50 VUs  2m43.0s/3m0s

running (3m00.0s), 50/50 VUs, 39205 complete and 0 interrupted iterations
query_mix   [  91% ] 50 VUs  2m44.0s/3m0s

running (3m01.0s), 50/50 VUs, 39443 complete and 0 interrupted iterations
query_mix   [  92% ] 50 VUs  2m45.0s/3m0s

running (3m02.0s), 50/50 VUs, 39681 complete and 0 interrupted iterations
query_mix   [  92% ] 50 VUs  2m46.0s/3m0s

running (3m03.0s), 50/50 VUs, 39924 complete and 0 interrupted iterations
query_mix   [  93% ] 50 VUs  2m47.0s/3m0s

running (3m04.0s), 50/50 VUs, 40163 complete and 0 interrupted iterations
query_mix   [  93% ] 50 VUs  2m48.0s/3m0s

running (3m05.0s), 50/50 VUs, 40407 complete and 0 interrupted iterations
query_mix   [  94% ] 50 VUs  2m49.0s/3m0s

running (3m06.0s), 50/50 VUs, 40651 complete and 0 interrupted iterations
query_mix   [  94% ] 50 VUs  2m50.0s/3m0s

running (3m07.0s), 50/50 VUs, 40888 complete and 0 interrupted iterations
query_mix   [  95% ] 50 VUs  2m51.0s/3m0s

running (3m08.0s), 50/50 VUs, 41132 complete and 0 interrupted iterations
query_mix   [  96% ] 50 VUs  2m52.0s/3m0s

running (3m09.0s), 50/50 VUs, 41372 complete and 0 interrupted iterations
query_mix   [  96% ] 50 VUs  2m53.0s/3m0s

running (3m10.0s), 50/50 VUs, 41608 complete and 0 interrupted iterations
query_mix   [  97% ] 50 VUs  2m54.0s/3m0s

running (3m11.0s), 50/50 VUs, 41850 complete and 0 interrupted iterations
query_mix   [  97% ] 50 VUs  2m55.0s/3m0s

running (3m12.0s), 50/50 VUs, 42092 complete and 0 interrupted iterations
query_mix   [  98% ] 50 VUs  2m56.0s/3m0s

running (3m13.0s), 50/50 VUs, 42330 complete and 0 interrupted iterations
query_mix   [  98% ] 50 VUs  2m57.0s/3m0s

running (3m14.0s), 50/50 VUs, 42571 complete and 0 interrupted iterations
query_mix   [  99% ] 50 VUs  2m58.0s/3m0s

running (3m15.0s), 50/50 VUs, 42811 complete and 0 interrupted iterations
query_mix   [  99% ] 50 VUs  2m59.0s/3m0s

running (3m16.0s), 50/50 VUs, 43056 complete and 0 interrupted iterations
query_mix ↓ [ 100% ] 50 VUs  3m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 43106   219.757492/s
    checks_succeeded...: 100.00% 43106 out of 43106
    checks_failed......: 0.00%   0 out of 43106

    ✓ status is 200

    CUSTOM
    query_duration_ms..............: avg=8.21ms  min=4.13ms   med=6.36ms   max=639.18ms p(90)=10.08ms  p(95)=12.37ms 

    HTTP
    http_req_duration..............: avg=8.57ms  min=4.13ms   med=6.37ms   max=639.18ms p(90)=10.12ms  p(95)=12.47ms 
      { expected_response:true }...: avg=8.57ms  min=4.13ms   med=6.37ms   max=639.18ms p(90)=10.12ms  p(95)=12.47ms 
    http_req_failed................: 0.00% 0 out of 43166
    http_reqs......................: 43166 220.063376/s

    EXECUTION
    iteration_duration.............: avg=208.9ms min=204.43ms med=207.07ms max=840.46ms p(90)=210.81ms p(95)=213.06ms
    iterations.....................: 43106 219.757492/s
    vus............................: 50    min=0          max=50
    vus_max........................: 50    min=50         max=50

    NETWORK
    data_received..................: 18 MB 94 kB/s
    data_sent......................: 24 MB 120 kB/s



running (3m16.2s), 00/50 VUs, 43106 complete and 0 interrupted iterations
query_mix ✓ [ 100% ] 50 VUs  3m0s